---
kind: property
id: P:Autodesk.Revit.DB.EdgeEndPoint.Index
source: html/057ef3de-82ee-6666-1132-bf77ebf1eb25.htm
---
# Autodesk.Revit.DB.EdgeEndPoint.Index Property

The index of the start or the end point of an Edge: 0 is the start point, 1 is the end point.

## Syntax (C#)
```csharp
public int Index { get; }
```